export const regexp = {
    // eslint-disable-next-line no-useless-escape
    email:
      /^[a-zA-Z0-9.!#$%&'*+\/=?^_`{|}~-]+@[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(?:\.[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/,
    url: /^(?:(?:(?:https?|ftp):)?\/\/)(?:\S+(?::\S*)?@)?(?:(?!(?:10|127)(?:\.\d{1,3}){3})(?!(?:169\.254|192\.168)(?:\.\d{1,3}){2})(?!172\.(?:1[6-9]|2\d|3[0-1])(?:\.\d{1,3}){2})(?:[1-9]\d?|1\d\d|2[01]\d|22[0-3])(?:\.(?:1?\d{1,2}|2[0-4]\d|25[0-5])){2}(?:\.(?:[1-9]\d?|1\d\d|2[0-4]\d|25[0-4]))|(?:(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+)(?:\.(?:[a-z\u00a1-\uffff0-9]-*)*[a-z\u00a1-\uffff0-9]+)*(?:\.(?:[a-z\u00a1-\uffff]{2,})).?)(?::\d{2,5})?(?:[/?#]\S*)?$/i,
    number: /^(?:-?\d+|-?\d{1,3}(?:,\d{3})+)?(?:\.\d+)?$/,
    isZipCode: /^[0-9]{6}$/,
    phone: /^1[3456789]\d{9}$/,
    // eslint-disable-next-line no-useless-escape
    character: /[`()\-+=<>:"{}|,.\/;'\\[\]·￥……（）——\-+={}|《》？：“”【】、；‘'，。、]/, // 只能包含除了@$!%*#_~?&^之外的特殊字符
    // eslint-disable-next-line no-useless-escape
    charAll: /[`~!@#$%^&*()_\-+=<>?:"{}|,.\/;'\\[\]·~！@#￥%……&*（）——\-+={}|《》？：“”【】、；‘'，。、]/, // 包含所有特殊字符
    // phone: /^((0\d{2,3}-\d{7,8})|(0\d{2,3}-\d{7,8}#\d{3,7})|(\d{7,8})|(\d{7,8}#\d{3,7})|((13[0-9]|14[5-9]|15[012356789]|166|17[0-8]|18[0-9]|19[8-9])[0-9]{8}))$/,
    // idCard: /^\d{15}(\d{2}[A-Za-z0-9])?$/,
    idCard:
      /^([1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2})$/,
    isAccount: /^\w+$/, // 字母下划线数字
    integer: /^([1-9]\d*|[0]{1,1})$/, // 0开头的正整数
    isUppercaseLetter: /[A-Z]/, // 是否包含大写字母
    isLowercaseLetter: /[a-z]/, // 是否包含小写字母
    isNumberHas: /\d+/, // 是否包含数字
    // eslint-disable-next-line no-useless-escape
    isHasStr: /(?=.*[!@#$%^&*,\.])/, // 是否包含字符
    // eslint-disable-next-line no-useless-escape
    isHasStr2: /[`~!@#$%^&*()_+<>?:"{},.\/;'[\]]/im, // 是否包含字符
    isChinese: /[\u4e00-\u9fa5]+/, // 是否包含中文
    password: /^(?=.*?[A-Z])(?=.*?[a-z])(?=.*?[0-9|^\w\s]).{8,}$/, // 密码正则校验,
    isUppercaseLetterAndNumber: /^[A-Z][A-Z0-9]*$/, // 大写字母开头，包含大写字母与数字
    isUppercaseLetterAndNumberStr: /^[A-Z][A-Z0-9\-/]*$/, // 大写字母开头，包含大写字母与数字
    certRegNo: /(^(?:(?![IOZSV])[\dA-Z]){2}\d{6}(?:(?![IOZSV])[\dA-Z]){10}$)|(^\d{15}$)/, // 营业执照号
  }